BellerageHackathon/src/Catalogs/ВариантыОтветовВерсий/ВариантыОтветовВерсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыОтветовВерсий</name>
  <owners>Catalog.ВопросыВерсийТестов</owners>
  <attributes>
    <name>ИдентификаторВарианта</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсииВарианта</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВарианта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Правильный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/Enums/СтатусыВерсийТестов/СтатусыВерсийТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВерсийТестов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Опубликована</name>
  </enumValues>
  <enumValues>
    <name>ЗамененаНовой</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Catalogs/ВариантыОтветовВерсий/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.Порядок = 0 Тогда
        Объект.Порядок = РабочееМестоТестированияСервер.СледующийПорядок("ВариантыОтветовВерсий", Объект.Владелец);
    КонецЕсли;
    ОбновитьДанные();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    ОбновитьДанные();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные()
    Элементы.Данные.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Владелец) И Объект.Владелец.Владелец.СтатусВерсии <> Перечисления.СтатусыВерсийТестов.Черновик;
    
КонецПроцедуры
